import { FC } from "react";
import { SITE_LINK } from "../shared.constant";

const Agreement: FC = () => {
    return (
        <div className="agreement">
            <h2>Пользовательское соглашение</h2>
<p>Данное пользовательское соглашение регулирует отношения между Администрацией Сайта {SITE_LINK} и пользователями сайта по использованию сайта {SITE_LINK}, по размещению на сайте комментариев и использованию материалов, расположенных на сайте {SITE_LINK}.</p>

<p><strong>Пожалуйста, внимательно прочитайте настоящее Соглашение и правила, прежде чем начать пользоваться сайтом {SITE_LINK} (далее по тексту — Сайт). Вы обязаны соблюдать условия Соглашения и правила, заходя на этот Сайт, используя его содержание и любые сервисы (услуги), предлагаемые на Сайте. В случае, если вы не согласны с условиями Соглашения и правилами, вы не можете пользоваться Сайтом или использовать его содержание, любые сервисы, предлагаемые на нем, а также посещать страницы, размещенные в доменной зоне Сайта.</strong></p>

<h3>1. Общие положения</h3>
<p>1.1. Сайт {SITE_LINK} является общедоступным для пользователей информационным ресурсом и осуществляет свою деятельность с соблюдением действующего законодательства Российской Федерации.</p>
<p>1.2. Отношения, связанные с использованием Сайта, регулируется законодательством Российской Федерации и настоящим Пользовательским соглашением.</p>
<p>1.3. Пользовательское соглашение является публичной офертой. Начиная использование Сайта, пользователь автоматически присоединяется к Пользовательскому соглашению и полностью принимает его условия.</p>
<p>1.4. Актуальная редакция Пользовательского Соглашения размещена по адресу: <a href={`https://${SITE_LINK}/agreement`}>https://{SITE_LINK}/agreement </a></p>
<p>1.5. Администрация Сайта может в любое время изменять Пользовательское соглашение по своему усмотрению.</p>
<p>1.6. Если пользователь не согласен с Пользовательским соглашением или с его отдельными условиями, он обязан прекратить использование Сайта и любых его материалов.</p>

<h3>2. Авторское право</h3>
<p>2.1. Исключительные авторские права на сайт, его название, статьи и иные произведения, размещенные на сайте, (за исключением фотографий) принадлежат Администрации Сайта.</p>
<p>2.2. Администрации сайта принадлежат неисключительные права на фотографии, размещенные на сайте. Часть фотографий взята из открытых для свободного использования произведений источников и используется Администрацией Сайта исключительно в информационных, некоммерческих целях.</p>
<p>2.3. Любое использование статей с Сайта, а также любых других материалов, в том числе воспроизведение и распространение любыми способами, публичный показ, доведение до всеобщего сведения, копирование (полное и частичное), перевод, переделка, запрещено без согласия правообладателя (Администрации Сайта).</p>
<p>2.4. Цитирование статей возможно с соблюдением условий, указанных в п. 2.5. Пользовательского соглашения.</p>
<p>2.5. При цитировании любых статей с Сайта в Интернете обязательна ссылка на первоисточник (подпункт 1 пункта 1 статьи 1274 ГК Российской Федерации) в виде активной, не закрытой от индексирования поисковыми системами ссылки на статью. При цитировании статей с Сайта в печатных изданиях обязательна ссылка на Сайт.</p>

<h3>3. Урегулирование споров, связанных с нарушением авторских прав</h3>
<p>3.1. Администрация Сайта отрицательно относится к нарушению авторских прав на публикуемые материалы и со своей стороны прикладывает все возможные усилия для предотвращения подобных нарушений на Сайте.</p>
<p>3.2. Если Вы являетесь автором или правообладателем исключительных прав, включая исключительное право на воспроизведение, публичный показ, доведение до всеобщего сведения, и считаете, что Ваши права каким-то образом нарушаются с использованием Сайта, мы просим незамедлительно связаться с Администрацией Сайта письмом в электронном виде.</p>
<p>3.3. Согласно действующему законодательству Российской Федерации Администрация Сайта готова рассмотреть любые спорные вопросы в рамках досудебного (претензионного или иного) порядка урегулирования.</p>
<p>3.4. Для этого необходимо прислать на электронную почту mail [cобaчка] {SITE_LINK} скан письма за подписью Правообладателя или его уполномоченного представителя, в котором указать следующие данные:
    <ul>
        <li>информацию об объекте авторского права (наименование произведения или продукта, документ, подтверждающий право собственности либо авторское право на изображение и т.д.);</li>
        <li>информацию о Правообладателе (для юридического лица — полное наименование организации, юридический адрес, скан документа о государственной регистрации; для физического лица — ФИО, паспортные данные);</li>
        <li>информация о представителе Правообладателя, подписавшего письмо (ФИО, должность, скан доверенности, для генерального директора — скан приказа/протокола о назначении);</li>
        <li>адрес страницы Сайта, где расположены материалы, права на которые принадлежат Правообладателю (ссылка должна иметь вид https://{SITE_LINK}/XXXXX );</li>
        <li>описание сути нарушения прав (почему распространение данной информации запрещено Правообладателем);</li>
        <li>дата, подпись;</li>
        <li>контактные данные: телефон, e-mail.</li>
    </ul>
</p>
<p>3.5. Администрация Сайта рассматривает обращение в срок, не превышающий 10 (десяти) календарных дней. В случае если Администрация Сайта признает обращение обоснованным, то соответствующие материалы будут удалены с Сайта незамедлительно.</p>
<p>3.6. Администрация Сайта преследует нарушение своих авторских прав, в том числе в судебном порядке.</p>
<p>3.7. Если вы хотите использовать какие-либо произведения, расположенные на сайте, то обязаны связаться с Администрацией Сайта по электронной почте mail [cобaчка] {SITE_LINK} для получения согласия. В противном случае использование произведений будет незаконным, и Администрация Сайта оставляет за собой право обращения с претензией в рамках досудебного урегулирования спора или в суд.</p>

<h3>4. Комментарии на сайте</h3>
<p>4.1. Пользователи на сайте могут оставлять комментарии. В комментариях пользователи могут высказывать свои мнения и распространять любые факты, за исключением тех, которые запрещены законодательством Российской Федерации, а также пунктом 4.3. Пользовательского соглашения.</p>
<p>4.2. За содержание и форму сведений, содержащихся в комментарии, пользователь несет ответственность. Пользователь гарантирует Администрации Сайта, что все содержащиеся в оставленном комментарии сведения являются достоверными.</p>
<p>4.3. Комментарии пользователей проходят премодерацию и публикуются на сайте после одобрения Администрацией Сайта.</p>
<p>4.4. Администрация Сайта имеет право удалять, редактировать, изменять комментарии по своему усмотрению без объяснения причин авторам комментариев. Администрация удаляет любые комментарии, которые не соответствуют законодательству Российской Федерации и/или пунктам 4.5. и 4.6. настоящего пользовательского соглашения.</p>
<p>4.5. На сайте запрещены комментарии, в которых содержатся:
    <ul>
        <li>оскорбление и клевета, распространяются не соответствующие действительности сведения;</li>
        <li>сведения о частной жизни, личной и семейной тайне;</li>
        <li>ненормативная лексика;</li>
        <li>высказывания экстремистского характера;</li>
        <li>реклама, коммерческие предложения, ссылки на другие Интернет сайты;</li>
        <li>спам и троллинг.</li>
    </ul>
</p>
<p>4.6. Не допускаются комментарии, нарушающие права интеллектуальной собственности третьи лиц.</p>

<h3>5. Прочие положения</h3>
<p>5.1. Пользователь несет самостоятельно ответственность перед третьими лицами за свои действия, связанные с использованием информации с Сайта.</p>
<p>5.2. Пользователь соглашается, что статьи на сайте сопровождаются рекламой. Администрация Сайта не несет какой-либо ответственности и не имеет каких-либо обязательств в связи с такой рекламой.</p>
<p>5.3. Пользователю запрещено осуществлять действия, направленные на нарушение нормальной работы Сайта.</p>
<p>5.4. Пользователь предупреждается, что Администрация Сайта не несет ответственности за посещение и использование им внешних сайтов, ссылки на которые размещены на Сайте.</p>

Вы не имеете права использовать возможности Сайта и посещать страницы, расположенные в области доменного имени https://{SITE_LINK}, в случае не согласия с настоящим соглашением и Правилами, пожалуйста, незамедлительно покиньте наш сайт.
        </div>
    )
}

export default Agreement