import { FC } from "react";
import { SITE_LINK } from "../shared.constant";

const PrivacyPolicy: FC = () => {
    return (
        <div className="privacy-policy">
            <h2>Политика конфиденциальности</h2>
            Администрация сайта <strong>{SITE_LINK}</strong> (далее по тексту — <strong>Сайт</strong>) с уважением относится к правам и безопасности посетителей Сайта. Мы безоговорочно признаем важность конфиденциальности личной информации посетителей. Данная Политика конфиденциальности (далее — <strong>Политика</strong>) содержит сведения о том, какую информацию мы получаем и собираем, когда вы пользуетесь Сайтом.
            В соответствии с законодательством о персональных данных мы просим вас ознакомиться с основными положениями Политики.
            Действие вышеупомянутой Политики конфиденциальности относится только к сайту {SITE_LINK} и не распространяется ни на какие другие ресурсы и веб-сайты третьих лиц, не находящиеся под нашим контролем.
            Администрация Сайта ни при каких обстоятельствах не продает и не отдает в пользование вашу личную информацию каким бы то ни было третьим сторонам. Мы также не раскрываем предоставленную вами личную информацию за исключением случаев, предусмотренных законодательством Российской Федерации, или если посетитель дал на это свое согласие.
            <h2>Сбор и использование данных</h2>
            <ol>
                <li>На Сайте отсутствуют приложения (личный кабинет, анкеты и пр.), которые могут стать источником персональной информации о вас. Мы не собираем информацию о вашем имени, адресе, адресе электронной почты или номере телефона.</li>
                <li>Сайт применяет технологию «cookie». Cookie — это небольшие файлы, состоящие из букв и цифр, которые скачиваются на ваш компьютер или мобильное устройство, когда вы посещаете веб-сайт. Затем cookie отправляются обратно на оригинальный веб-сайт в каждое последующее посещение или на любой веб-сайт, который распознает этот cookie.
                    Cookie исполняют целый ряд функций, например, позволяют вам эффективно перемещаться между веб-страницами, запоминая ваши предпочтения, и, таким образом, улучшает опыт взаимодействия с веб-сайтами. Они также могут способствовать тому, что реклама, которую вы видите онлайн, соответствует вашим интересам.
                    В сookie содержится информация, которая может быть необходимой для сбора статистической информации по Сайту: какие страницы вы посетили, что было загружено, имя домена интернет-провайдера и страна посетителя, адреса сторонних веб-сайтов, с которых совершен переход на Сайт и так далее. Однако вся эта информация никак не связана с вами как с личностью. Файлы cookie не записывают ваш адрес электронной почты и никакие личные сведения относительно вас.
                    При использовании Сайта, вы даете нам согласие на использование файлов cookie в соответствии с настоящей политикой в отношении данного типа файлов. Если вы не согласны с тем, чтобы мы использовали данный тип файлов, то вы должны соответствующим образом установить настройки вашего браузера или не использовать сайт {SITE_LINK}.</li>
                <li>Администрация Cайта имеет партнерские отношения со сторонними рекламными сетями и компаниями (Яндекс, Google и др.), далее — Компании-партнеры. Компании-партнеры на возмездной основе размещают на страницах Сайта рекламные материалы и объявления (включая, но не ограничиваясь, текстовые гиперссылки и баннеры). В рамках данного сотрудничества Администрация Сайта доводит до сведения заинтересованных сторон следующую информацию:
            Компании Яндекс и Google как сторонние поставщики используют файлы cookie для показа объявлений на Сайте как участнике программ Рекламная сеть Яндекса и Google AdSense для контента.
            Использование файлов cookie позволяет этим компаниям собирать и использовать информацию о посетителях Сайта (за исключением имени, адреса, адреса электронной почты или номера телефона), о ваших посещениях Сайта и других веб-сайтов с целью предоставления наиболее релевантных объявлений о товарах и услугах.
            Компании-партнеры в процессе сбора данной информации руководствуется собственной политикой конфиденциальности.</li>
                <li>Мы используем стандартные журналы учета веб-сервера для подсчета количества посетителей и оценки технических возможностей нашего Сайта. Мы используем эту информацию для того, чтобы определить, сколько человек посещает Сайт, и организовать страницы наиболее удобным для пользователей способом, обеспечить соответствие Сайта используемым браузерам и сделать содержание наших страниц максимально полезным для наших посетителей. Мы записываем сведения по перемещениям по Сайту, но не об отдельных посетителях Сайта, так что никакая конкретная информация относительно вас лично не будет сохраняться или использоваться Администрацией Сайта без вашего согласия.</li>
                <li>Личные данные посетителей Сайта, которые поступают в адрес Администрации, предоставляются посетителями добровольно и используются в целях переписки с ними, если они не указали иное их назначение (например, публикация на сайте или передача третьим лицам).</li>
                <li>Вам следует знать, что используемое нами программное обеспечение Сайта может в автоматическом режиме получать общую информацию о пользователе (например, ваш текущий ip-адрес и файлы cookie).</li>
            </ol>
            <h2>Изменение настоящей политики конфиденциальности</h2>
            Политика конфиденциальности Сайта может изменяться. Мы никогда не будем ограничивать права посетителей Сайта без их явно выраженного согласия. Актуальная версия документа доступна по адресу: <a href="https://{SITE_LINK}/privacy-policy">https://{SITE_LINK}/privacy-policy</a>.
            <h2>Отказ от предоставления гарантий</h2>
            Мы прилагаем максимум усилий для соответствия этой Политике конфиденциальности и предпринимаем все разумные меры по защите имеющейся в нашем распоряжении информации о пользователях от уничтожения, искажения или разглашения. Однако Администрация Сайта не может гарантировать абсолютное соответствие данным стандартам и не может отвечать за сохранение и нераскрытие личных сведений.
            Передача информации личного характера при посещении сторонних сайтов, включая сайты компаний-партнеров, даже если веб-сайт содержит ссылку на Сайт или на Сайте есть ссылка на эти веб-сайты, не подпадает под действия данного документа. Администрация Сайта не несет ответственности за действия других веб-сайтов. Процесс сбора и передачи информации личного характера при посещении этих веб-сайтов регламентируется опубликованным на них документом «Политика конфиденциальности» или аналогичным.
        </div>
    )
}

export default PrivacyPolicy